src/blogs/capture.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-29 Mon 21:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brent-computer" />
</head>
<body>
<div id="content">
<p>
Org-capture
</p>

<p>
To complement my running log discussed in the previous entry, I decided to experiment with org-capture.
I set up my first capture template using the orgmode docs, but I thought it might be handy to have a 
more thorough reference that combines the template elements page and the general capture templates page
with a real example. The structure of an org-capture-template is as shown below:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">setq</span> org-capture-templates
    '((&lt;keys&gt; &lt;description&gt; &lt;type&gt; &lt;target&gt; &lt;template&gt; &lt;properties&gt;)))
</pre>
</div>

<p>
As described <a href="https://orgmode.org/manual/Template-elements.html#Template-elements">in the docs</a>, <code>&lt;keys&gt;</code> are the keys that select for the template when you call org-capture, 
<code>&lt;description&gt;</code> is just a short string describing the template, <code>&lt;type&gt;</code> is the type of the entry, 
<code>&lt;target&gt;</code> is the location for the capture item, <code>&lt;template&gt;</code> is the template for creating the item,
and <code>&lt;properties&gt;</code> are additional options. The template I created for my running log is below.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">setq</span> org-capture-templates
    '((<span style="color: #e9b96e;">"r"</span> <span style="color: #e9b96e;">"Log a run"</span> table-line (file+headline <span style="color: #e9b96e;">"~/Notes/running.org"</span> <span style="color: #e9b96e;">"Log"</span>)
        <span style="color: #e9b96e;">"| | %^{Day?} | %^{Distance?} | %^{Time? (HH:MM:SS)} | | %^{Route?} | %^{Notes | } |"</span>)))
</pre>
</div>

<p>
I bound it to the key "r" and write to the file ~/Notes/running.org under the heading Log. At that
point it appends a line to my table and the <code>%^{Prompt}</code> sections prompt me for what to include.  
One problem I was having was that the capture would abort if I tried to leave a field empty. This 
was especially important because I don't expect most of my runs to have any notes, but this was 
easily fixed by adding a pipe to the Notes prompt. From the docs, the prompt can include a 
default value (empty in my case), as well as possible completions separated by pipes in the format
<code>%^{prompt|default|completion2|completion3...}</code>.
</p>

<p>
There are still a couple of things missing from this. The first is the problem associated with a 
new week, at which point I will need another entry in the first cell, and the second is rerunning
the pace calculation to fill that cell. However, these are not really that important and can be 
fixed easily by editing the file directly. The first problem could also be fixed by prompting also 
for the week, but the number of prompts was already high enough that I did not want to add another for
something I would use only once a week. Overall, I will definitely be playing more with org-capture,
especially once I have a well-established todo list because it seems super handy to quickly append 
something to a file without having to find it first. Additionally, I will probably add a hotkey for
org-capture so I don't have to run M-x org-capture each time.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brent-computer</p>
<p class="date">Created: 2019-07-29 Mon 21:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
